In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("../input/Name list wa blast Madev End User.xlsx")
df.head()

   Sal  Contact/First Name                  Contact/Last Name Contact/Mobile
0  NaN                 NaN                                NaN  0815 17159585
1  NaN                 NaN       Makassar Orient Logistics PT  0813 55943336
2  NaN                 NaN            Sintra Cargo Service PT  0813 43602107
3  NaN                 NaN           LMS Logistic Makassar PT  0821 96708348
4  NaN                 NaN  Himeji Express PT Cabang Makassar   0811 3515152

In [3]:
# Remove all whitespaces
df["Contact/Mobile"] = df["Contact/Mobile"].str.replace(" ", "")
# Add +62 prefix to all Contact/Mobile numbers

df["Contact/Mobile"] = df["Contact/Mobile"].str.replace("-", "")
# Remove the first "0" if it exists
df["Contact/Mobile"] = df["Contact/Mobile"].str.lstrip("0")

# Add +62 prefix to all Contact/Mobile numbers
df["Contact/Mobile"] = "+62" + df["Contact/Mobile"]

df.fillna('', inplace=True)

df.head()

/var/folders/l0/7qjh0cvx5d7d6hvq3n835gf40000gn/T/ipykernel_6306/702497354.py:12: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.fillna('', inplace=True)

  Sal Contact/First Name                  Contact/Last Name  Contact/Mobile
0                                                            +6281517159585
1                              Makassar Orient Logistics PT  +6281355943336
2                                   Sintra Cargo Service PT  +6281343602107
3                                  LMS Logistic Makassar PT  +6282196708348
4                         Himeji Express PT Cabang Makassar   +628113515152

In [4]:
df.to_excel("../input/fixed.xlsx", index=False)